Repository: 4d-depot/HDI_ORDA_ComputedAttributes
Catalog: Resources/*.lproj/orda.xlf
Languages: fr

# TIP_SelectPerson
source: SELECT ONE PERSON TO DISPLAY THEIR FAMILY MEMBERS
fr: SÉLECTIONNEZ UNE PERSONNE POUR AFFICHER LES MEMBRES DE SA FAMILLE

# Help_Fullname
source: The fullname attribute is assembled using the person's first and last name. It is followed by the age in brackets if the person is deceased. This calculation is done in the "peopleEntity" class via the "get fullname" function which is called as soon as the attribute is invoked.
fr: L'attribut fullname est basé sur le prénom et le nom de la personne, éventuellement suivi de l'age entre parenthèses si la personne est décédée. Ce calcul est fait dans la classe "peopleEntity" via la fonction "get fullname" qui est appellée dès que l'attribut est invoqué.

# Help_Portrait
source: A calculated attribute can also be of type image. Here the picture colors vary according to the person's age. Full colors for children and parents, black and white or sepia for ancestors!
fr: Un attribut calculé peut aussi être du type image. Ici la photo de la personne correspond à son age. En couleur pour les enfants et les parents, en noir et blanc ou sépia pour les ancêtres !

# Help_Age
source: The calculated attribute "age" is based on the person's date of birth. This calculation is done in the "peopleEntity" class via the get age function which is called as soon as the attribute is needed.
fr: L'attribut calculé "age" est basé sur la date de naissance de la personne. Ce calcul est fait dans la classe "peopleEntity" via la fonction get age qui est appellée dès que l'attribut est nécessaire.

# Help_OrderBy
source: When a sort is done, via the interface or by programming, the "orderBy genderSymbol", "orderBy fullname" and "orderBy age" functions of the class are called (if they exist) in order to optimize the sorting. In this case, we understand the interest of having created, beforehand, a composite index "firstname + lastname" or "lastname + firstname" for the sorting by fullname, and to have an index for the gender and the date of birth!
fr: Lorsqu'un tri est effetué, via l'interface ou par programmation, la fonction "orderBy genderSymbol", "orderBy fullname" et "orderBy age" de la classe sont appellées (si elles existent) afin d'optimiser le tri. Dans le cas présent, on comprend l'intérêt d'avoir créé, au préalable un index composite "prénom + nom" ou "non + prénom" pour le tri par fullname, et d'avoir un index sur le genre et la date de naissance !

# Help_QueryName
source: When a search is performed based on the "fullname" attribute, the "query fullname" function of the "peopleEntity" class is called (if it exists) in order to optimize or even personalize the search. Ex: if you search for "pa te", you can decide that the first name starts with "pa" and the last name with "te" or the opposite... or both!
fr: Lorsqu'une recherche est effectuée basée sur l'attribut "fullname", la fonction "query fullname" de la classe "peopleEntity" est appelée (si elle existe) afin d'optimiser, voire de personnaliser la recherche. Ex: si vous recherchez "pa te", vous pourrez décider que le nom commence par "pa" et le nom par "te" ou l'inverse… ou les deux !

# Help_QueryAge
source: When a search is performed based on the "age" attribute, the "query age" function of the "peopleEntity" class is called (if it exists) to optimize the search. The "birthday" attribute being indexed, it is indeed much faster to perform the search via this attribute.
fr: Lorsqu'une recherche est effectuée basée sur l'attribut "age", la fonction "query age" de la classe "peopleEntity" est appellée (si elle existe) afin d'optimiser la recherche. L'attribut "birthday" étant indexé il est en effet bien plus rapide d'effectuer la recherche via cet attribut.

# Help_ObjectAttribute
source: A calculated attribute can also be of type Object. It is the case with the attribute "fullAddress", which is calculated from several other attributes including "fullname", which is itself a calculated attribute!
fr: Un attribut calculé peut également être du type Objet ! C'est le cas de l'attribut "fullAddress" qui est calculé à partir de plusieurs autres attributs dont "fullname" qui est lui-même un attribut calculé !

# Help_EntitySelection
source: A calculated attribute can also be a selection of entities! We can thus have, in a genealogy database, attributes such as "parents", "grandparents", "siblings", "childrens", etc. which can in turn be used as datasources for list boxes for example. All of this without any additional code in the form!
fr: Un attribut calculé peut également être une sélection d'entités ! On peut donc avoir dans une base de généalogie des attributs "parents", grandparents","siblings", "childrens", etc. qui pourront à leur tour servir de datasources à des list boxes par exemple. Sans aucun code supplémentaire dans le formulaire !

# Help_GenderIcon
source: The icon is in fact a Unicode character which is returned according to the gender. A sorting function can therefore be called to sort this column. The color of the symbol is defined by the "meta" method defined in the list box itself.
fr: L'icône est en fait un caractère "unicode" qui est renvoyé en fonction du genre. une fonction de tri pourra donc être appelée pour trier cette colonne. La couleur du symbole est définie par la méthode "meta" définie dans la list box elle-même.

source: Full name
fr: Nom complet

source: Birthday
fr: Date de naissance

source: Query
fr: Recherche

# NameHiphen
source: Name:
fr: Nom :

source: Full address
fr: Adresse complète

source: Grand parents
fr: Grands-parents

source: Children
fr: Enfants

source: Uncles and aunts
fr: Oncles et tantes

source: Siblings
fr: Frères et sœurs

source: Hide help
fr: Masquer l'aide

source: Edit code
fr: Éditer le code

# HowTo
source: This database demonstrates how to: - Use classes with computed attributes, - Manage sorts and queries that use these computed attributes.
fr: Cette base de donnée explique comment : - Utiliser les classes avec des attributs calculés, - Gérer les recherches et les tris sur ces attributs calculés.

# DBinfo
source: This database contains <1> records.
fr: Cette base de données contient <1> enregistrements.

# GnerateMoreData
source: Generate more data…
fr: Générer plus de données…

# HowMany
source: How many people would you like to generate ?
fr: Combien de personne souhaitez-vous générer ?

# CalculatedAttributes
source: Computed attributes
fr: Attributs calculés

# PreviousEpisodes
source: (*) Previous episodes are still available here!
fr: (*) Les épisodes précédents sont toujours disponibles ici !
